# sorting

In [3]:
ls = input("Words to be sorted") # 
sorted_list = sorted(set(ls.split(',')))
print (sorted_list)

Words to be sortedbat,ant,cat,dog
['ant', 'bat', 'cat', 'dog']

# Machine Learning

In [4]:
#Import necessary Libraries
import pandas as pd
import numpy as np

In [5]:
df=pd.read_csv('https://media-doselect.s3.amazonaws.com/generic/oRNLYo72WOXZeEGxywq9GZQOQ/training-training-train.zip')

In [6]:
df.head()

,Months since Last Donation,Number of Donations,Total Volume Donated (c.c.),Months since First Donation,target
0,4,9,2250,38,1
1,2,1,250,2,0
2,2,1,250,2,0
3,2,6,1500,35,1
4,21,1,250,21,0

In [7]:
df.isnull().sum()

Months since Last Donation     0
Number of Donations            0
Total Volume Donated (c.c.)    0
Months since First Donation    0
target                         0
dtype: int64

In [8]:
x=df.iloc[:,0:4]
x

,Months since Last Donation,Number of Donations,Total Volume Donated (c.c.),Months since First Donation
0,4,9,2250,38
1,2,1,250,2
2,2,1,250,2
3,2,6,1500,35
4,21,1,250,21
...,...,...,...,...
455,2,6,1500,16
456,2,11,2750,26
457,4,6,1500,16
458,11,5,1250,41
459,2,11,2750,40

In [9]:
y=df[['target']]
y.head()

   target
0       1
1       0
2       0
3       1
4       0

In [10]:
from sklearn.model_selection import train_test_split
#from sklearn.cross_validation import train_test_split
x_train, x_test, y_train, y_test = train_test_split (x, y, test_size = .20, random_state = 0)

In [11]:
from sklearn.linear_model import LogisticRegression
LRClassifier = LogisticRegression (max_iter=1000)

In [12]:
LRClassifier.fit(x_train,y_train)

C:\Users\Manish\anaconda3\lib\site-packages\sklearn\utils\validation.py:63: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(*args, **kwargs)

LogisticRegression(max_iter=1000)

In [13]:
prediction = LRClassifier.predict (x_test)
from sklearn.metrics import accuracy_score

print(accuracy_score(y_test, prediction))

0.8152173913043478

In [14]:
df2=pd.read_csv('https://media-doselect.s3.amazonaws.com/generic/jOW4L4e1N51xzpGQwy1AjeBjx/validation-evaluation-test.zip')

In [15]:
prediction = LRClassifier.predict (df2)

In [16]:
print(prediction)

[0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
 0 0 0 0 0]

In [17]:
prediction=pd.DataFrame(prediction)
prediction

     0
0    0
1    0
2    0
3    0
4    0
..  ..
111  0
112  0
113  0
114  0
115  0

[116 rows x 1 columns]

In [18]:
prediction.columns=['target']
prediction.to_csv(r'C:/Users/Manish/Desktop/edb/dataset/pred.csv', index= False)